sdk/GoCardlessSDK/src/test/resources/billing_request/dual_flow_request.json

{"billing_requests":{"status":"unknown","mandate_request":{"currency":"GBP","scheme":"bacs","verify":"recommended","links":{},"metadata":{"postman":"payment-mandate-br"}},"payment_request":{"description":"Awesome Frozen Pants","currency":"GBP","amount":23956,"links":{},"metadata":{"postman":"payment-mandate-br"}},"metadata":{"test":"BR332"},"links":{},"actions":[],"resources":{"customer":{"metadata":{}},"customer_billing_detail":{}}}}